src/Documents/_МедиапланРазмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>_МедиапланРазмещение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Медиаплан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Медиаплан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиМедиаплана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Площадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитыватьФакт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баннер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._adfox_banner</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/_МедиапланРазмещение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура МедиапланПриИзмененииНаСервере()

	Объект.СтрокиМедиаплана.Очистить();
	
	ДанныеМедиаплана = ПолучитьДанныеМедиплана();
	Если ДанныеМедиаплана <> Неопределено Тогда 
		Объект.СтрокиМедиаплана.Загрузить(ДанныеМедиаплана);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеМедиплана()

	
	Запрос = Новый Запрос;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("Медиаплан", Объект.Медиаплан);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	_МедиапланСтрокиМедиаплана.КлючСвязи КАК КлючСвязи,
	|	_МедиапланСтрокиМедиаплана.Номенклатура КАК Номенклатура,
	|	СУММА(_МедиапланСтрокиМедиапланаРасшифровка.Количество + _МедиапланСтрокиМедиапланаРасшифровка.БонусКоличество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ДанныеМедиаплана
	|ИЗ
	|	Документ._Медиаплан.СтрокиМедиаплана КАК _МедиапланСтрокиМедиаплана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._Медиаплан.СтрокиМедиапланаРасшифровка КАК _МедиапланСтрокиМедиапланаРасшифровка
	|		ПО _МедиапланСтрокиМедиаплана.Ссылка = _МедиапланСтрокиМедиапланаРасшифровка.Ссылка
	|			И _МедиапланСтрокиМедиаплана.КлючСвязи = _МедиапланСтрокиМедиапланаРасшифровка.КлючСвязи
	|ГДЕ
	|	_МедиапланСтрокиМедиаплана.Ссылка = &Медиаплан
	|
	|СГРУППИРОВАТЬ ПО
	|	_МедиапланСтрокиМедиаплана.Номенклатура,
	|	_МедиапланСтрокиМедиаплана.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеМедиаплана.КлючСвязи КАК КлючСвязи,
	|	ВТ_ДанныеМедиаплана.Номенклатура КАК Номенклатура,
	|	Номенклатура_Состав.Площадка КАК Площадка,
	|	Номенклатура_Состав.НеУчитыватьФакт КАК НеУчитыватьФакт,
	|	ВТ_ДанныеМедиаплана.Количество * Номенклатура_Состав.Коэффициент КАК Количество
	|ИЗ
	|	ВТ_ДанныеМедиаплана КАК ВТ_ДанныеМедиаплана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура._Состав КАК Номенклатура_Состав
	|		ПО ВТ_ДанныеМедиаплана.Номенклатура = Номенклатура_Состав.Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе 
		Возврат Результат.Выгрузить();
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура МедиапланПриИзменении(Элемент)
	МедиапланПриИзмененииНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры
